# Day6

In [1]:
# EDA

In [106]:
import pandas as pd
import numpy as np
cars = pd.read_csv('/Users/Ganesh/Desktop/usedcars.csv')

In [93]:
cars.head()

     year model    price  mileage   color transmission
0  2011.0   SEL  21992.0   7413.0  Yellow         AUTO
1  2011.0   SEL  20995.0  10926.0    Gray         AUTO
2  2011.0   SEL  19995.0      NaN  Silver         AUTO
3  2011.0   SEL  17809.0  11613.0    Gray         AUTO
4     NaN    SE  17500.0   8367.0   White         AUTO

In [94]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
year            149 non-null float64
model           150 non-null object
price           148 non-null float64
mileage         147 non-null float64
color           150 non-null object
transmission    150 non-null object
dtypes: float64(3), object(3)
memory usage: 7.1+ KB

In [95]:
cars.drop(['transmission', 'color'], axis=1, inplace=True)

In [96]:
cars.head(2)

     year model    price  mileage
0  2011.0   SEL  21992.0   7413.0
1  2011.0   SEL  20995.0  10926.0

In [97]:
cars.sort_values(by='mileage', inplace=True)

In [98]:
cars.head(2)

      year model    price  mileage
32  2011.0    SE  14992.0   4867.0
0   2011.0   SEL  21992.0   7413.0

In [99]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 32 to 25
Data columns (total 4 columns):
year       149 non-null float64
model      150 non-null object
price      148 non-null float64
mileage    147 non-null float64
dtypes: float64(3), object(1)
memory usage: 5.9+ KB

In [100]:
cars.head(2)

      year model    price  mileage
32  2011.0    SE  14992.0   4867.0
0   2011.0   SEL  21992.0   7413.0

In [101]:
cars.columns = cars.columns.str.upper()

In [102]:
cars.head()

      YEAR MODEL    PRICE  MILEAGE
32  2011.0    SE  14992.0   4867.0
0   2011.0   SEL  21992.0   7413.0
26  2010.0    SE  15499.0   7784.0
4      NaN    SE  17500.0   8367.0
11  2011.0   SES  16992.0   9199.0

In [103]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 32 to 25
Data columns (total 4 columns):
YEAR       149 non-null float64
MODEL      150 non-null object
PRICE      148 non-null float64
MILEAGE    147 non-null float64
dtypes: float64(3), object(1)
memory usage: 5.9+ KB

In [105]:
sample = np.array([90, 75, 85, 92, np.nan])

In [120]:
np.mean(sample)

nan

In [122]:
np.nanmean(sample)

85.5

In [109]:
np.median(sample)

/Users/Ganesh/anaconda3/lib/python3.6/site-packages/numpy/lib/function_base.py:4033: RuntimeWarning: Invalid value encountered in median
  r = func(a, **kwargs)

nan

In [110]:
cars.head()

     year model    price  mileage   color transmission
0  2011.0   SEL  21992.0   7413.0  Yellow         AUTO
1  2011.0   SEL  20995.0  10926.0    Gray         AUTO
2  2011.0   SEL  19995.0      NaN  Silver         AUTO
3  2011.0   SEL  17809.0  11613.0    Gray         AUTO
4     NaN    SE  17500.0   8367.0   White         AUTO

In [146]:
missing_cars = cars[cars.isnull().any(axis=1)]

In [167]:
type(missing_cars)

pandas.core.frame.DataFrame

In [169]:
missing_cars.median()

year        2011.0
price      16750.0
mileage    16035.0
dtype: float64

In [170]:
help(missing_cars.agg)

Help on method aggregate in module pandas.core.frame:

aggregate(func, axis=0, *args, **kwargs) method of pandas.core.frame.DataFrame instance
    Aggregate using callable, string, dict, or list of string/callables

    .. versionadded:: 0.20.0

    Parameters
    ----------
    func : callable, string, dictionary, or list of string/callables
        Function to use for aggregating the data. If a function, must either
        work when passed a DataFrame or when passed to DataFrame.apply. For
        a DataFrame, can pass a dict, if the keys are DataFrame column names.

        Accepted Combinations are:

        - string function name
        - function
        - list of functions
        - dict of column names -> functions (or list of functions)

    Notes
    -----
    Numpy functions mean/median/prod/sum/std/var are special cased so the
    default behavior is applying the function along axis=0
    (e.g., np.mean(arr_2d, axis=0)) as opposed to
    mimicking the default Numpy behavior (e.g., np.mean(arr_2d)).

    `agg` is an alias for `aggregate`. Use the alias.

    Returns
    -------
    aggregated : DataFrame

    Examples
    --------

    >>> df = pd.DataFrame(np.random.randn(10, 3), columns=['A', 'B', 'C'],
    ...                   index=pd.date_range('1/1/2000', periods=10))
    >>> df.iloc[3:7] = np.nan

    Aggregate these functions across all columns

    >>> df.agg(['sum', 'min'])
                A         B         C
    sum -0.182253 -0.614014 -2.909534
    min -1.916563 -1.460076 -1.568297

    Different aggregations per column

    >>> df.agg({'A' : ['sum', 'min'], 'B' : ['min', 'max']})
                A         B
    max       NaN  1.514318
    min -1.916563 -1.460076
    sum -0.182253       NaN

    See also
    --------
    pandas.DataFrame.apply
    pandas.DataFrame.transform
    pandas.DataFrame.groupby.aggregate
    pandas.DataFrame.resample.aggregate
    pandas.DataFrame.rolling.aggregate

In [117]:
cars.isnull().sum()

year            1
model           0
price           2
mileage         3
color           0
transmission    0
dtype: int64

In [133]:
missing_cars

      year model    price  mileage   color transmission
2   2011.0   SEL  19995.0      NaN  Silver         AUTO
4      NaN    SE  17500.0   8367.0   White         AUTO
8   2011.0   SES      NaN  32655.0  Silver         AUTO
14  2011.0    SE  16000.0      NaN   White         AUTO
20  2010.0   SES      NaN  16035.0  Silver       MANUAL
25  2010.0    SE  15500.0      NaN    Blue         AUTO

In [153]:
missing_cars

      year model    price  mileage   color transmission
2   2011.0   SEL  19995.0      NaN  Silver         AUTO
4      NaN    SE  17500.0   8367.0   White         AUTO
8   2011.0   SES      NaN  32655.0  Silver         AUTO
14  2011.0    SE  16000.0      NaN   White         AUTO
20  2010.0   SES      NaN  16035.0  Silver       MANUAL
25  2010.0    SE  15500.0      NaN    Blue         AUTO

In [154]:
missing_cars.year.mode()

0    2011.0
dtype: float64

In [158]:
missing_cars.year = missing_cars.fillna('2011')

/Users/Ganesh/anaconda3/lib/python3.6/site-packages/pandas/core/generic.py:3643: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

In [156]:
missing_cars

    year model    price  mileage   color transmission
2   2011   SEL  19995.0      NaN  Silver         AUTO
4    NaN    SE  17500.0   8367.0   White         AUTO
8   2011   SES      NaN  32655.0  Silver         AUTO
14  2011    SE  16000.0      NaN   White         AUTO
20  2010   SES      NaN  16035.0  Silver       MANUAL
25  2010    SE  15500.0      NaN    Blue         AUTO

In [140]:
missing_cars.color.unique()

array(['Silver', 'White', 'Blue'], dtype=object)

In [63]:
df.iloc[:,:-1].head(2)

   year model  price  mileage   color
0  2011   SEL  21992     7413  Yellow
1  2011   SEL  20995    10926    Gray

In [64]:
df.head(2)

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO

In [160]:
from sklearn.datasets import load_boston
boston = load_boston()

In [163]:
boston.feature_names

array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
       'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7')

In [164]:
boston.DESCR

"Boston House Prices dataset\n===========================\n\nNotes\n------\nData Set Characteristics:  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive\n    \n    :Median Value (attribute 14) is usually the target\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttp://archive.ics.uci.edu/ml/datasets/Housing\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n**References**\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n   - many more! (see http://archive.ics.uci.edu/ml/datasets/Housing)\n"